[
  {
    "id": "1",
    "title": "Library Reading Buddy Program",
    "Briefdescription": "Help children improve their reading skills in a fun, supportive library environment.",
    "description": "Make a lasting impact on a child's future by joining our Library Reading Buddy Program. As a reading buddy, you will be paired one-on-one with a child aged 6-12 to help them develop crucial literacy skills and, more importantly, a genuine love for reading. Your role involves more than just listening; you'll engage in interactive reading, play word games, and help children select books that spark their curiosity. We provide all necessary training and a wealth of resources to ensure you feel confident and prepared. This is a perfect opportunity for patient, encouraging individuals who want to see the direct results of their efforts as a child's confidence and abilities grow week by week.",
    "startdate": "2025-07-15T00:00:00.000Z",
    "enddate": "2025-08-15T00:00:00.000Z",
    "schedule": "Weekdays, 3:00 PM – 5:00 PM",
    "location": "Downtown",
    "timeCommitment": "Weekly commitment",
    "ageRequirement": "16+",
    "organization": "City Library",
    "image": "/images/library-reading.jpg"
  },
  {
    "id": "2",
    "title": "Park Cleanup Crew",
    "Briefdescription": "Join a community initiative to keep our parks clean and beautiful.",
    "description": "Roll up your sleeves and make a visible difference in our community's green spaces. The Park Cleanup Crew is a hands-on initiative that brings together nature lovers and civic-minded individuals. On event days, you'll work as part of a friendly team to remove litter from trails, clear invasive plant species that threaten local ecosystems, and assist with light landscaping projects like mulching and planting. We provide all the necessary tools, gloves, and safety guidance. It's a fantastic way to get some fresh air and exercise while contributing to a cleaner, safer, and more beautiful environment for everyone to enjoy.",
    "startdate": "2025-08-05T00:00:00.000Z",
    "enddate": "2025-08-05T00:00:00.000Z",
    "schedule": "Saturday, 9:00 AM – 12:00 PM",
    "location": "Westside",
    "timeCommitment": "Half-day",
    "ageRequirement": "13+",
    "organization": "Green City Volunteers",
    "image": "/images/park-cleanup.jpg"
  },
  {
    "id": "3",
    "title": "Community Food Drive",
    "Briefdescription": "Help collect and organize food donations for families in need across the city.",
    "description": "Be a vital part of our mission to fight local hunger. Our Community Food Drive relies on dedicated volunteers to ensure that donations get to the families who need them most. In this role, you could be doing a variety of tasks, from greeting donors and accepting contributions at a collection site, to weighing, sorting, and shelving food items at our central warehouse. You might also help pack customized grocery boxes for distribution. This is a dynamic role where you can see the direct impact of your work and connect with other compassionate members of your community.",
    "startdate": "2025-09-01T00:00:00.000Z",
    "enddate": "2025-09-30T00:00:00.000Z",
    "schedule": "Flexible shifts",
    "location": "Eastside",
    "timeCommitment": "1–2 hours",
    "ageRequirement": "18+",
    "organization": "Helping Hands Network",
    "image": "/images/food-drive.jpg"
  },
  {
    "id": "4",
    "title": "Animal Shelter Weekend Helper",
    "Briefdescription": "Assist with walking dogs, cleaning enclosures, and socializing with cats at our city shelter.",
    "description": "Are you an animal lover? Spend your weekend providing essential care and comfort to pets awaiting their forever homes. As an Animal Shelter Weekend Helper, your contribution is critical. You will help with daily tasks like walking dogs to give them exercise and enrichment, cleaning and sanitizing enclosures to ensure a healthy environment, and spending quiet time socializing with cats to help them become more adoptable. The shelter can be a stressful place for animals, and your calm, positive presence can make all the difference in their well-being. Full training on safe animal handling procedures is provided.",
    "startdate": "2025-07-20T00:00:00.000Z",
    "enddate": "2025-12-20T00:00:00.000Z",
    "schedule": "Saturdays & Sundays, 10:00 AM - 4:00 PM",
    "location": "Uptown",
    "timeCommitment": "Half-day",
    "ageRequirement": "18+",
    "organization": "City Animal Care",
    "image": "/images/animal-shelter.jpg"
  },
  {
    "id": "5",
    "title": "Senior Companion Visitor",
    "Briefdescription": "Visit with elderly residents in a local nursing home to provide companionship and conversation.",
    "description": "Brighten someone's day and combat loneliness by becoming a Senior Companion Visitor. Many elderly residents in care facilities lack regular visitors, and your presence can be a highlight of their week. In this deeply rewarding role, you will be matched with a senior to provide companionship and social interaction. Activities are simple but meaningful: sharing stories, reading a newspaper or book aloud, playing cards, listening to music, or simply being a friendly, attentive listener. This flexible opportunity allows you to build a genuine connection and bring joy and a sense of community to an elder's life.",
    "startdate": "2025-06-10T00:00:00.000Z",
    "enddate": "2025-12-31T00:00:00.000Z",
    "schedule": "Flexible, 1-2 hours per week",
    "location": "Suburbs",
    "timeCommitment": "1–2 hours",
    "ageRequirement": "18+",
    "organization": "Golden Years Connect",
    "image": "/images/senior-companion.jpg"
  },
  {
    "id": "6",
    "title": "Community Garden Tending",
    "Briefdescription": "Help maintain our community garden by weeding, watering, and harvesting fresh produce.",
    "description": "Connect with the earth and your community at our urban garden. We cultivate fresh, organic produce that is donated directly to local food banks and shelters. We are looking for volunteers to help with all aspects of garden upkeep. Depending on the day, you might be planting seedlings, turning compost, watering beds, pulling weeds, or harvesting ripe vegetables. It's a peaceful and satisfying way to spend an afternoon, learn about sustainable food production, and contribute to the health and food security of your neighbors. No prior gardening experience is required—just a willingness to get a little dirty!",
    "startdate": "2025-08-12T00:00:00.000Z",
    "enddate": "2025-08-12T00:00:00.000Z",
    "schedule": "Tuesday, 4:00 PM - 6:00 PM",
    "location": "Eastside",
    "timeCommitment": "One-time event",
    "ageRequirement": "13+",
    "organization": "Urban Growers Collective",
    "image": "/images/community-garden.jpg"
  },
  {
    "id": "7",
    "title": "Youth Soccer Coach Assistant",
    "Briefdescription": "Assist the head coach in running drills and managing a youth soccer team for the fall season.",
    "description": "Be a role model and mentor for the next generation of athletes! Our youth soccer league is seeking energetic and positive volunteers to serve as Assistant Coaches. You will work alongside a head coach to create a fun, supportive, and safe environment for kids to learn the game. Your main responsibilities will include helping to set up and run practice drills, offering encouragement to players on and off the field, and reinforcing lessons of teamwork and good sportsmanship. A basic knowledge of soccer is helpful, but the most important qualification is a great attitude and a desire to work with children.",
    "startdate": "2025-09-05T00:00:00.000Z",
    "enddate": "2025-11-15T00:00:00.000Z",
    "schedule": "Tuesdays & Thursdays, 5:30 PM - 7:00 PM",
    "location": "Westside",
    "timeCommitment": "Weekly commitment",
    "ageRequirement": "16+",
    "organization": "City Rec League",
    "image": "/images/youth-soccer.jpg"
  },
  {
    "id": "8",
    "title": "Annual Arts Festival Support",
    "Briefdescription": "Help make our city's annual arts festival a success by assisting with setup and guiding attendees.",
    "description": "Immerse yourself in creativity and community by volunteering at the city's largest cultural event! The Annual Arts Festival depends on a large team of enthusiastic volunteers to run smoothly. There are many ways to contribute: you could be part of the setup crew that brings the festival to life, welcome guests at an information booth, assist children with crafts in the family zone, or provide support to exhibiting artists. It's a high-energy day filled with music, art, and food. As a volunteer, you'll get a behind-the-scenes look at the festival and be an essential part of creating a memorable experience for thousands of attendees.",
    "startdate": "2025-10-04T00:00:00.000Z",
    "enddate": "2025-10-04T00:00:00.000Z",
    "schedule": "Saturday, 8:00 AM - 6:00 PM (shifts available)",
    "location": "Downtown",
    "timeCommitment": "Full-day",
    "ageRequirement": "16+",
    "organization": "Downtown Arts Alliance",
    "image": "/images/art-festival.jpg"
  }
]